{
  "status": "success",
  "totalResults": 100,
  "results": [
    {
      "article_id": "business_001",
      "title": "Indian startups attract strong investor interest despite global slowdown",
      "description": "Indian startups continue to draw funding as investors focus on sustainable growth and profitability.",
      "content": "Despite a challenging global economic environment, Indian startups have continued to attract strong investor interest. Venture capital firms are now prioritizing sustainable business models, realistic valuations, and long-term profitability. Fintech, SaaS, and health-tech startups have seen renewed funding activity, indicating growing confidence in India’s entrepreneurial ecosystem.",
      "pubDate": "2025-01-05 10:15:00",
      "image_url": "https://picsum.photos/600/400?random=business1",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_002",
      "title": "RBI maintains cautious stance on interest rates amid inflation concerns",
      "description": "The Reserve Bank of India keeps interest rates unchanged while monitoring inflation closely.",
      "content": "The Reserve Bank of India has decided to keep interest rates unchanged, citing manageable inflation levels. Policymakers emphasized maintaining a balance between economic growth and price stability. Analysts believe the move provides stability to borrowers while allowing room for future policy adjustments.",
      "pubDate": "2025-01-06 08:40:00",
      "image_url": "https://picsum.photos/600/400?random=business2",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_003",
      "title": "Major IT firms announce aggressive hiring plans for 2025",
      "description": "India’s top IT companies plan to expand hiring with focus on digital skills.",
      "content": "Leading IT firms in India have announced large-scale hiring plans for 2025, focusing on roles in artificial intelligence, cloud computing, and cybersecurity. Industry experts say increasing global demand for digital transformation is driving workforce expansion across the sector.",
      "pubDate": "2025-01-07 09:30:00",
      "image_url": "https://picsum.photos/600/400?random=business3",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_004",
      "title": "E-commerce growth accelerates in tier-2 and tier-3 cities",
      "description": "Online shopping expands beyond metro cities due to better infrastructure.",
      "content": "India’s e-commerce industry is witnessing strong growth in tier-2 and tier-3 cities. Improved logistics, affordable smartphones, and increased trust in digital payments have contributed to this trend. Companies are investing in regional warehouses to meet rising demand.",
      "pubDate": "2025-01-08 11:10:00",
      "image_url": "https://picsum.photos/600/400?random=business4",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_005",
      "title": "Rising global oil prices impact aviation and logistics companies",
      "description": "Fuel price volatility pressures airline and transport sector margins.",
      "content": "Fluctuating global oil prices are affecting India’s aviation and logistics sectors. Airlines are reviewing ticket pricing strategies, while logistics firms focus on route optimization and fuel efficiency to manage rising operational costs.",
      "pubDate": "2025-01-09 07:55:00",
      "image_url": "https://picsum.photos/600/400?random=business5",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },

    {
      "article_id": "business_006",
      "title": "Manufacturing sector gains momentum with government incentives",
      "description": "Policy reforms and incentives boost domestic manufacturing output.",
      "content": "India’s manufacturing sector is gaining momentum due to government-led incentive programs. Production-linked incentives and infrastructure development are encouraging companies to expand domestic manufacturing capabilities and reduce import dependency.",
      "pubDate": "2025-01-10 10:00:00",
      "image_url": "https://picsum.photos/600/400?random=business6",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_007",
      "title": "Banking sector remains resilient amid global market volatility",
      "description": "Indian banks report stable growth and improved asset quality.",
      "content": "Despite global market volatility, Indian banks have shown resilience with improved asset quality and steady credit growth. Digital banking initiatives have further enhanced efficiency and customer engagement across the sector.",
      "pubDate": "2025-01-11 09:20:00",
      "image_url": "https://picsum.photos/600/400?random=business7",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_008",
      "title": "Retail inflation influences consumer spending behavior",
      "description": "Consumers prioritize essentials amid rising prices.",
      "content": "Retail inflation is influencing household spending patterns, with consumers focusing more on essential goods. Retailers are responding with targeted discounts and promotional strategies to retain customer interest.",
      "pubDate": "2025-01-12 08:50:00",
      "image_url": "https://picsum.photos/600/400?random=business8",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_009",
      "title": "Corporate mergers and acquisitions gain momentum",
      "description": "Strategic deals increase across technology and energy sectors.",
      "content": "Corporate mergers and acquisitions are rising as companies seek strategic advantages and market expansion. Technology, energy, and pharmaceutical sectors have witnessed increased consolidation activity.",
      "pubDate": "2025-01-13 12:05:00",
      "image_url": "https://picsum.photos/600/400?random=business9",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_010",
      "title": "Renewable energy investments surge amid sustainability push",
      "description": "Businesses increase spending on solar and wind energy projects.",
      "content": "Investment in renewable energy has surged as companies focus on sustainability goals. Solar and wind energy projects are expanding rapidly, supported by favorable government policies and declining technology costs.",
      "pubDate": "2025-01-14 09:45:00",
      "image_url": "https://picsum.photos/600/400?random=business10",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },

    {
      "article_id": "business_011",
      "title": "India’s exports show steady growth despite global challenges",
      "description": "Strong demand supports export performance across key sectors.",
      "content": "India’s exports have shown steady growth driven by demand in pharmaceuticals, engineering goods, and IT services. Trade experts say diversification of export markets has helped mitigate global economic uncertainties.",
      "pubDate": "2025-01-15 08:30:00",
      "image_url": "https://picsum.photos/600/400?random=business11",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_012",
      "title": "Automobile industry accelerates transition to electric vehicles",
      "description": "EV adoption increases as manufacturers expand electric portfolios.",
      "content": "Automobile manufacturers are accelerating their transition toward electric vehicles. Improved charging infrastructure and government incentives are encouraging consumers to adopt EVs at a faster pace.",
      "pubDate": "2025-01-16 10:10:00",
      "image_url": "https://picsum.photos/600/400?random=business12",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_013",
      "title": "Real estate sector stabilizes with improved housing demand",
      "description": "Residential property demand shows signs of recovery.",
      "content": "The real estate sector is stabilizing as housing demand improves in urban areas. Lower interest rates and improved buyer sentiment have contributed to increased residential property sales.",
      "pubDate": "2025-01-17 11:00:00",
      "image_url": "https://picsum.photos/600/400?random=business13",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_014",
      "title": "Digital payments continue rapid growth across India",
      "description": "UPI transactions reach new milestones.",
      "content": "Digital payments continue to grow rapidly in India, with UPI transactions reaching record levels. Increased smartphone adoption and trust in digital platforms are driving the shift toward cashless payments.",
      "pubDate": "2025-01-18 09:10:00",
      "image_url": "https://picsum.photos/600/400?random=business14",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_015",
      "title": "Pharmaceutical companies expand global manufacturing presence",
      "description": "Indian pharma firms increase overseas investments.",
      "content": "Indian pharmaceutical companies are expanding their global manufacturing footprint to strengthen supply chains and meet rising international demand. Experts believe this move enhances India’s position as a global pharma hub.",
      "pubDate": "2025-01-19 10:25:00",
      "image_url": "https://picsum.photos/600/400?random=business15",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },

    {
      "article_id": "business_016",
      "title": "Startup IPO activity expected to increase this year",
      "description": "Market conditions support new public listings.",
      "content": "Several startups are preparing for initial public offerings as market conditions improve. Analysts expect increased IPO activity as companies aim to capitalize on favorable valuations.",
      "pubDate": "2025-01-20 08:40:00",
      "image_url": "https://picsum.photos/600/400?random=business16",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_017",
      "title": "Supply chain reforms improve efficiency across industries",
      "description": "Technology adoption enhances logistics and distribution.",
      "content": "Supply chain reforms and technology adoption are improving efficiency across industries. Companies are leveraging data analytics and automation to reduce costs and enhance delivery timelines.",
      "pubDate": "2025-01-21 09:55:00",
      "image_url": "https://picsum.photos/600/400?random=business17",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_018",
      "title": "India’s GDP growth outlook remains positive",
      "description": "Economic indicators support optimistic growth projections.",
      "content": "India’s GDP growth outlook remains positive, supported by strong domestic consumption and infrastructure investment. Economists remain cautiously optimistic despite global economic uncertainties.",
      "pubDate": "2025-01-22 10:30:00",
      "image_url": "https://picsum.photos/600/400?random=business18",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_019",
      "title": "Logistics startups leverage AI to optimize operations",
      "description": "Artificial intelligence improves efficiency and cost control.",
      "content": "Logistics startups are increasingly adopting AI-powered solutions to optimize routing, reduce fuel consumption, and improve delivery accuracy. The trend is transforming traditional logistics operations.",
      "pubDate": "2025-01-23 11:15:00",
      "image_url": "https://picsum.photos/600/400?random=business19",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    },
    {
      "article_id": "business_020",
      "title": "Corporate governance reforms strengthen investor confidence",
      "description": "Transparency initiatives improve market trust.",
      "content": "Corporate governance reforms and stricter compliance norms are strengthening investor confidence. Transparency and accountability initiatives are helping businesses attract long-term investment.",
      "pubDate": "2025-01-24 09:00:00",
      "image_url": "https://picsum.photos/600/400?random=business20",
      "source_id": "newsio_business",
      "category": ["business"],
      "language": "en"
    }
  ],
  "nextPage": "2"
}
